export function makeTimelineTemplate() {
  return [
    {
      no: 1,
      operator: 'กฟฟ.',
      detail: 'Upload File ZAAR020 (from SAP)',
      document: 'File ZAAR020  รายงานขออนุมัติจำหน่ายมิเตอร์ชำรุด',
      document_hint: 'File ZAAR020',
      status: 'pending'
    },
    {
      no: 2,
      operator: 'กฟฟ.',
      detail: 'รายงานผลจากคณะกรรมการสอบหาข้อเท็จจริง (ส่งหนังสือถึง กบล.)',
      document: 'หนังสือขออนุมัติจำหน่ายมิเตอร์และอุปกรณ์ประกอบ',
      document_hint: 'หนังสือขออนุมัติจำหน่ายมิเตอร์และอุปกรณ์ประกอบ',
      status: 'pending'
    },
    {
      no: 3,
      operator: 'กบล.',
      detail: 'อนุมัติจำหน่าย',
      document: 'หนังสืออนุมัติจำหน่ายจากผู้มีอำนาจลงนาม',
      document_hint: 'หนังสืออนุมัติจำหน่ายจากผู้มีอำนาจลงนาม',
      status: 'pending'
    },
    {
      no: 4,
      operator: 'คณะกรรมการประเมินราคา',
      detail: 'กำหนดราคาขายขั้นต่ำ โดยดำเนินการตามข้อ 5 และ 6',
      document: 'คำนวณราคาและขออนุมัติเห็นชอบราคาขายขั้นต่ำ',
      document_hint: 'ใบขออนุมัติเห็นชอบราคาขายขั้นต่ำ',
      status: 'pending'
    },
    { no: '4.1', operator: 'คณะกรรมการประเมินราคา', detail: 'คำนวณราคาขายของมิเตอร์ ซีที พีที', document: 'ตารางคำนวณการประเมินราคา', status: 'pending' },
    { no: '4.2', operator: 'คณะกรรมการประเมินราคา', detail: 'เสนอผู้มีอำนาจฯ*เห็นชอบราคาขั้นต่ำ', document: 'หนังสืออนุมัติเห็นชอบราคาขายขั้นต่ำ', status: 'pending' },
    {
      no: 5,
      operator: 'กฟฟ.',
      detail: 'จัดทำหนังสือขออนุมัติหลักการขายจากผู้มีอำนาจสั่งขาย',
      document: 'หนังสืออนุมัติหลักการขาย',
      document_hint: 'หนังสืออนุมัติหลักการขาย',
      status: 'pending'
    },
    { no: 6, operator: 'กฟฟ.', detail: 'วิธีการขาย มี 3 วิธี', document: '', status: 'pending' },
    {
      no: 7,
      operator: 'กฟฟ.',
      detail: 'จัดทำเอกสารประกาศขายและเผยแพร่การขาย (แจ้ง กบพ.ลงประกาศ)',
      document: 'เอกสารประกาศขายและเผยแพร่การขาย',
      document_hint: 'เอกสารประกาศขาย',
      status: 'pending'
    },
    { no: '7.1', operator: 'คณะกรรมการดำเนินการขาย', detail: 'ผู้สนใจเข้ารับซอง…ลงทะเบียนการรับซอง', document: 'เอกสารลงทะเบียน', status: 'pending' },
    { no: '7.2', operator: 'กฟฟ.', detail: 'ผู้เสนอราคายื่นซอง…ทำตารางเปรียบเทียบราคา', document: 'ทะเบียนรับเอกสารฯ และตารางเปรียบเทียบราคา', status: 'pending' },
    {
      no: 8,
      operator: 'คณะกรรมการดำเนินการขาย',
      detail: 'ขออนุมัติรับราคาและขออนุมัติหลักการขายจากผู้มีอำนาจสั่งขาย',
      document: 'หนังสืออนุมัติรับราคา',
      document_hint: 'หนังสืออนุมัติรับราคา',
      status: 'pending'
    },
    {
      no: 9,
      operator: 'คณะกรรมการดำเนินการขาย',
      detail: 'รับชำระเงิน และออกใบเสร็จให้ผู้รับซื้อ',
      document: 'ใบเสร็จรับเงิน',
      document_hint: 'ใบเสร็จรับเงิน และ ใส่จำนวนเงิน',
      status: 'pending'
    },
    {
      no: 10,
      operator: 'กฟฟ.',
      detail: 'ตัดจำหน่าย (ZMME024) และพิมพ์ใบจ่ายของ (ตัดจำหน่าย MIGO MvT 555)',
      document: 'ใบจ่ายของ (ตัดจำหน่าย MvT 555)',
      document_hint: 'ใบจ่ายของ (ตัดจำหน่าย MvT 555)',
      status: 'pending'
    },
    {
      no: 11,
      operator: 'คณะกรรมการส่งมอบพัสดุ',
      detail: 'ทำหนังสือรายงานผลการดำเนินการขาย และส่งมอบ',
      document: 'หนังสือรายงานการส่งมอบและรับมอบ',
      document_hint: 'หนังสือรายงานการส่งมอบและรับมอบ',
      status: 'pending'
    },
    {
      no: 12,
      operator: 'คณะกรรมการส่งมอบพัสดุ',
      detail: 'รายงานผลการขาย ส่งให้ กบฟ. เพื่อตัดจำหน่ายออกจากบัญชีสินทรัพย์',
      document: 'หนังสือรายงานการขาย',
      document_hint: 'หนังสือรายงานการขาย',
      status: 'pending'
    },
    {
      no: 13,
      operator: 'กบฟ.',
      detail: 'ตัดจำหน่ายทรัพย์สินออกจากระบบบัญชีสินทรัพย์',
      document: 'ตัดจำหน่ายทรัพย์สิน (AA)',
      document_hint: 'ตัดจำหน่ายทรัพย์สิน (AA)',
      status: 'pending'
    }
  ]
}
